Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/ipc.h
/* -------- IPC_ISR : (IPC Offset: 0x18) ( R/ 32) Interrupt Status Register -------- */
#define IPC_ISR_IRQ0_Pos                      _UINT32_(0)                                          /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ0_Msk                      (_UINT32_(0x1) << IPC_ISR_IRQ0_Pos)                  /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ0(value)                   (IPC_ISR_IRQ0_Msk & (_UINT32_(value) << IPC_ISR_IRQ0_Pos)) /* Assigment of value for IRQ0 in the IPC_ISR register */
#define IPC_ISR_IRQ1_Pos                      _UINT32_(1)                                          /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ1_Msk                      (_UINT32_(0x1) << IPC_ISR_IRQ1_Pos)                  /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ1(value)                   (IPC_ISR_IRQ1_Msk & (_UINT32_(value) << IPC_ISR_IRQ1_Pos)) /* Assigment of value for IRQ1 in the IPC_ISR register */
#define IPC_ISR_IRQ2_Pos                      _UINT32_(2)                                          /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ2_Msk                      (_UINT32_(0x1) << IPC_ISR_IRQ2_Pos)                  /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ2(value)                   (IPC_ISR_IRQ2_Msk & (_UINT32_(value) << IPC_ISR_IRQ2_Pos)) /* Assigment of value for IRQ2 in the IPC_ISR register */
#define IPC_ISR_IRQ3_Pos                      _UINT32_(3)                                          /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ3_Msk                      (_UINT32_(0x1) << IPC_ISR_IRQ3_Pos)                  /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ3(value)                   (IPC_ISR_IRQ3_Msk & (_UINT32_(value) << IPC_ISR_IRQ3_Pos)) /* Assigment of value for IRQ3 in the IPC_ISR register */
#define IPC_ISR_IRQ4_Pos                      _UINT32_(4)                                          /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ4_Msk                      (_UINT32_(0x1) << IPC_ISR_IRQ4_Pos)                  /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ4(value)                   (IPC_ISR_IRQ4_Msk & (_UINT32_(value) << IPC_ISR_IRQ4_Pos)) /* Assigment of value for IRQ4 in the IPC_ISR register */
#define IPC_ISR_IRQ5_Pos                      _UINT32_(5)                                          /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ5_Msk                      (_UINT32_(0x1) << IPC_ISR_IRQ5_Pos)                  /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ5(value)                   (IPC_ISR_IRQ5_Msk & (_UINT32_(value) << IPC_ISR_IRQ5_Pos)) /* Assigment of value for IRQ5 in the IPC_ISR register */
#define IPC_ISR_IRQ6_Pos                      _UINT32_(6)                                          /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ6_Msk                      (_UINT32_(0x1) << IPC_ISR_IRQ6_Pos)                  /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ6(value)                   (IPC_ISR_IRQ6_Msk & (_UINT32_(value) << IPC_ISR_IRQ6_Pos)) /* Assigment of value for IRQ6 in the IPC_ISR register */
#define IPC_ISR_IRQ7_Pos                      _UINT32_(7)                                          /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ7_Msk                      (_UINT32_(0x1) << IPC_ISR_IRQ7_Pos)                  /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ7(value)                   (IPC_ISR_IRQ7_Msk & (_UINT32_(value) << IPC_ISR_IRQ7_Pos)) /* Assigment of value for IRQ7 in the IPC_ISR register */
#define IPC_ISR_IRQ8_Pos                      _UINT32_(8)                                          /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ8_Msk                      (_UINT32_(0x1) << IPC_ISR_IRQ8_Pos)                  /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ8(value)                   (IPC_ISR_IRQ8_Msk & (_UINT32_(value) << IPC_ISR_IRQ8_Pos)) /* Assigment of value for IRQ8 in the IPC_ISR register */
#define IPC_ISR_IRQ9_Pos                      _UINT32_(9)                                          /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ9_Msk                      (_UINT32_(0x1) << IPC_ISR_IRQ9_Pos)                  /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ9(value)                   (IPC_ISR_IRQ9_Msk & (_UINT32_(value) << IPC_ISR_IRQ9_Pos)) /* Assigment of value for IRQ9 in the IPC_ISR register */
#define IPC_ISR_IRQ10_Pos                     _UINT32_(10)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ10_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ10_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ10(value)                  (IPC_ISR_IRQ10_Msk & (_UINT32_(value) << IPC_ISR_IRQ10_Pos)) /* Assigment of value for IRQ10 in the IPC_ISR register */
#define IPC_ISR_IRQ11_Pos                     _UINT32_(11)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ11_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ11_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ11(value)                  (IPC_ISR_IRQ11_Msk & (_UINT32_(value) << IPC_ISR_IRQ11_Pos)) /* Assigment of value for IRQ11 in the IPC_ISR register */
#define IPC_ISR_IRQ12_Pos                     _UINT32_(12)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ12_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ12_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ12(value)                  (IPC_ISR_IRQ12_Msk & (_UINT32_(value) << IPC_ISR_IRQ12_Pos)) /* Assigment of value for IRQ12 in the IPC_ISR register */
#define IPC_ISR_IRQ13_Pos                     _UINT32_(13)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ13_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ13_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ13(value)                  (IPC_ISR_IRQ13_Msk & (_UINT32_(value) << IPC_ISR_IRQ13_Pos)) /* Assigment of value for IRQ13 in the IPC_ISR register */
#define IPC_ISR_IRQ14_Pos                     _UINT32_(14)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ14_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ14_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ14(value)                  (IPC_ISR_IRQ14_Msk & (_UINT32_(value) << IPC_ISR_IRQ14_Pos)) /* Assigment of value for IRQ14 in the IPC_ISR register */
#define IPC_ISR_IRQ15_Pos                     _UINT32_(15)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ15_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ15_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ15(value)                  (IPC_ISR_IRQ15_Msk & (_UINT32_(value) << IPC_ISR_IRQ15_Pos)) /* Assigment of value for IRQ15 in the IPC_ISR register */
#define IPC_ISR_IRQ16_Pos                     _UINT32_(16)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ16_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ16_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ16(value)                  (IPC_ISR_IRQ16_Msk & (_UINT32_(value) << IPC_ISR_IRQ16_Pos)) /* Assigment of value for IRQ16 in the IPC_ISR register */
#define IPC_ISR_IRQ17_Pos                     _UINT32_(17)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ17_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ17_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ17(value)                  (IPC_ISR_IRQ17_Msk & (_UINT32_(value) << IPC_ISR_IRQ17_Pos)) /* Assigment of value for IRQ17 in the IPC_ISR register */
#define IPC_ISR_IRQ18_Pos                     _UINT32_(18)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ18_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ18_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ18(value)                  (IPC_ISR_IRQ18_Msk & (_UINT32_(value) << IPC_ISR_IRQ18_Pos)) /* Assigment of value for IRQ18 in the IPC_ISR register */
#define IPC_ISR_IRQ19_Pos                     _UINT32_(19)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ19_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ19_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ19(value)                  (IPC_ISR_IRQ19_Msk & (_UINT32_(value) << IPC_ISR_IRQ19_Pos)) /* Assigment of value for IRQ19 in the IPC_ISR register */
#define IPC_ISR_IRQ20_Pos                     _UINT32_(20)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ20_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ20_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ20(value)                  (IPC_ISR_IRQ20_Msk & (_UINT32_(value) << IPC_ISR_IRQ20_Pos)) /* Assigment of value for IRQ20 in the IPC_ISR register */
#define IPC_ISR_IRQ21_Pos                     _UINT32_(21)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ21_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ21_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ21(value)                  (IPC_ISR_IRQ21_Msk & (_UINT32_(value) << IPC_ISR_IRQ21_Pos)) /* Assigment of value for IRQ21 in the IPC_ISR register */
#define IPC_ISR_IRQ22_Pos                     _UINT32_(22)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ22_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ22_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ22(value)                  (IPC_ISR_IRQ22_Msk & (_UINT32_(value) << IPC_ISR_IRQ22_Pos)) /* Assigment of value for IRQ22 in the IPC_ISR register */
#define IPC_ISR_IRQ23_Pos                     _UINT32_(23)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ23_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ23_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ23(value)                  (IPC_ISR_IRQ23_Msk & (_UINT32_(value) << IPC_ISR_IRQ23_Pos)) /* Assigment of value for IRQ23 in the IPC_ISR register */
#define IPC_ISR_IRQ24_Pos                     _UINT32_(24)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ24_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ24_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ24(value)                  (IPC_ISR_IRQ24_Msk & (_UINT32_(value) << IPC_ISR_IRQ24_Pos)) /* Assigment of value for IRQ24 in the IPC_ISR register */
#define IPC_ISR_IRQ25_Pos                     _UINT32_(25)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ25_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ25_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ25(value)                  (IPC_ISR_IRQ25_Msk & (_UINT32_(value) << IPC_ISR_IRQ25_Pos)) /* Assigment of value for IRQ25 in the IPC_ISR register */
#define IPC_ISR_IRQ26_Pos                     _UINT32_(26)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ26_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ26_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ26(value)                  (IPC_ISR_IRQ26_Msk & (_UINT32_(value) << IPC_ISR_IRQ26_Pos)) /* Assigment of value for IRQ26 in the IPC_ISR register */
#define IPC_ISR_IRQ27_Pos                     _UINT32_(27)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ27_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ27_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ27(value)                  (IPC_ISR_IRQ27_Msk & (_UINT32_(value) << IPC_ISR_IRQ27_Pos)) /* Assigment of value for IRQ27 in the IPC_ISR register */
#define IPC_ISR_IRQ28_Pos                     _UINT32_(28)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ28_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ28_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ28(value)                  (IPC_ISR_IRQ28_Msk & (_UINT32_(value) << IPC_ISR_IRQ28_Pos)) /* Assigment of value for IRQ28 in the IPC_ISR register */
#define IPC_ISR_IRQ29_Pos                     _UINT32_(29)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ29_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ29_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ29(value)                  (IPC_ISR_IRQ29_Msk & (_UINT32_(value) << IPC_ISR_IRQ29_Pos)) /* Assigment of value for IRQ29 in the IPC_ISR register */
#define IPC_ISR_IRQ30_Pos                     _UINT32_(30)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ30_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ30_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ30(value)                  (IPC_ISR_IRQ30_Msk & (_UINT32_(value) << IPC_ISR_IRQ30_Pos)) /* Assigment of value for IRQ30 in the IPC_ISR register */
#define IPC_ISR_IRQ31_Pos                     _UINT32_(31)                                         /* (IPC_ISR) Current Interrupt Identifier Position */
#define IPC_ISR_IRQ31_Msk                     (_UINT32_(0x1) << IPC_ISR_IRQ31_Pos)                 /* (IPC_ISR) Current Interrupt Identifier Mask */
#define IPC_ISR_IRQ31(value)                  (IPC_ISR_IRQ31_Msk & (_UINT32_(value) << IPC_ISR_IRQ31_Pos)) /* Assigment of value for IRQ31 in the IPC_ISR register */
#define IPC_ISR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (IPC_ISR) Register Mask  */

#define IPC_ISR_IRQ_Pos                       _UINT32_(0)                                          /* (IPC_ISR Position) Current Interrupt Identifier */
#define IPC_ISR_IRQ_Msk                       (_UINT32_(0xFFFFFFFF) << IPC_ISR_IRQ_Pos)            /* (IPC_ISR Mask) IRQ */
#define IPC_ISR_IRQ(value)                    (IPC_ISR_IRQ_Msk & (_UINT32_(value) << IPC_ISR_IRQ_Pos)) 

/* -------- IPC_WPMR : (IPC Offset: 0x1C) (R/W 32) Write Protection Mode Register -------- */
#define IPC_WPMR_WPITEN_Pos                   _UINT32_(1)                                          /* (IPC_WPMR) Write Protection Interrupt Enable Position */
#define IPC_WPMR_WPITEN_Msk                   (_UINT32_(0x1) << IPC_WPMR_WPITEN_Pos)               /* (IPC_WPMR) Write Protection Interrupt Enable Mask */
#define IPC_WPMR_WPITEN(value)                (IPC_WPMR_WPITEN_Msk & (_UINT32_(value) << IPC_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the IPC_WPMR register */
#define IPC_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (IPC_WPMR) Write Protection Key Position */
#define IPC_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << IPC_WPMR_WPKEY_Pos)           /* (IPC_WPMR) Write Protection Key Mask */
#define IPC_WPMR_WPKEY(value)                 (IPC_WPMR_WPKEY_Msk & (_UINT32_(value) << IPC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the IPC_WPMR register */
#define   IPC_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x495043)                                   /* (IPC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define IPC_WPMR_WPKEY_PASSWD                 (IPC_WPMR_WPKEY_PASSWD_Val << IPC_WPMR_WPKEY_Pos)    /* (IPC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define IPC_WPMR_Msk                          _UINT32_(0xFFFFFF02)                                 /* (IPC_WPMR) Register Mask  */


